import logo from '../logo.svg';
import * as Concact from "../style/Sintro"
import * as Common from "../style/Common"
function Intro(){
    return(
          <Common.Section>
            <p className='title'>Introduce</p>
            {/* <p className='text'>학습에서 즐거움을 찾는 개발자 백승철입니다.<br/><br/>
              “사람들과 함께 학습하며 성장하자”라는 모토를 갖고 웹 개발과 관련된 다양한 분야를 학습 중입니다. <br/><br/>
              다양한 학습 환경을 만드는 것을 좋아하며 성장하는 습관을 만들어 가고 있습니다.<br/><br/>
              사람들과 함께 학습하며 성장하기 위해 지난 2년간 4개의 개발교육 프로그램에 참여하여 동료들과 학습을 공유하고 함께 프로젝트를 진행하며 개발 역량을 쌓아왔습니다.<br/><br/>
              또한 꾸준한 개발 성장 습관을 만들기 위해 자바스크립트, 리액트, 알고리즘 분야로 지난 1년간 약 10개의 스터디를 운영 및 참여하여 학습을 해야 하는 환경과 잘 할 수 있는 환경을 만들기 위해 노력해왔습니다.<br/><br/>
              그리고 학습을 하면서 학습했던 내용들을 벨로그에 꾸준히 기록하여 약 200개 이상의 포스팅을 남겼습니다.
            </p> */}
            <p className='text'>
              커뮤니케이션 능력이 좋은 프론트엔드 개발자 백승철입니다.<br/><br/>
              "소통을 통해 더 나은 결과물을 창출할 수 있다"라는 생각을 가지고 있습니다.<br/>
              실제 신규 프로젝트에서는 기획 단계부터 참여를 했고, 기간이 얼마 안남은 상태에서
              디자인 시안이 전면 수정되는 상황이 발생해 디자이너에게 부트스트랩을 공유하고 부트스트랩 기반 디자인으로 함께 시안을 만들어 
              일정에 차질 없이 마무리한 경험이 있고, 신입 백엔드 개발자와 협업하는 과정에서
              API개발이 늦어져 JSON형식으로 구상하는 데이터 형식을 공유를 부탁해 더미 데이터를 
              생성 후 고객사에게 일정에 맞춰 시안을 제출한 경험이 있습니다.
              각 부서별로 어떤 문제점이 발생 한다면 해당 문제를 공유하고 해결 방법을 찾아야 하기에
              커뮤니케이션 능력이 좋은것이 저의 큰 장점이라고 생각합니다.
              

              <br/>
              <br/>
              <br/>

              문제 해결을 위해 적극적으로 행동합니다. 프로젝트 진행 중 혼자서 해결이 어려운 문제를 당면했을 때 내부에서 도움을 요청할 곳이 없어 함께 프로젝트를 잠깐 진행했던 프리랜서 개발자님 연락처를 찾아 양해를 구한 뒤 찾아뵙고 문제를 해결했던 경험이 있습니다.
              <br/>
              <br/>
              <br/>

              새로움에 도전하고 받아들일 준비가 되어있습니다. 아직 기술의 스펙이 넓지 않아 다른 사람이 만들어 놓은 코드를 수정해야 하는 경우 관련 공식 문서 및 자료들을 찾아 학습하고 조금씩 코드가 읽히고 분석이 가능해지며 진행이 가능해질 때 큰 성취감을 얻었습니다. 앞으로도 새로운 기술을 접할 기회가 있다면 적극적으로 제 스펙을 넓혀 가겠습니다.
            </p>
          </Common.Section>
    )
}

export default Intro
